Hello! 

With provider version `v1.1.0-beta2` I definitely see less changes in the terraform plan. And `vlan id` also was not changed.

But still enough changes to be worried about the net result of the change. For example why `inner_vlan` is marked with + sign. It makes me think that vlan will be changed.
 
```
# megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
```

Full putput:

```
Terraform will perform the following actions:

  # megaport_mve.fortigate will be updated in-place
  ~ resource "megaport_mve" "fortigate" {
      ~ contract_start_date    = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ last_updated           = "Monday, 29-Jul-24 16:34:33 EEST" -> (known after apply)
      ~ live_date              = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      + terminate_date         = (known after apply)
        # (26 unchanged attributes hidden)
    }

  # megaport_port.ipxgrx will be updated in-place
  ~ resource "megaport_port" "ipxgrx" {
      ~ contract_end_date      = "Monday, 28-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date    = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date            = "Monday, 29-Jul-24 16:34:00 EEST" -> (known after apply)
      ~ last_updated           = "Monday, 29-Jul-24 16:34:33 EEST" -> (known after apply)
      ~ live_date              = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          ~ interface = {
              ~ demarcation = <<-EOT
                    Equinix PA2/3
                    114 Rue Ambroise Croizat, Saint Denis
                    0210
                    Type: Single-mode Fibre Pair
                    Ports: PP:0210:1177142, ports 11+12
                    Termination: SC connector
                EOT -> (known after apply)
              ~ up          = 1 -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + terminate_date         = (known after apply)
        # (17 unchanged attributes hidden)
    }

  # megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "09e400a0-1b72-49ec-8ff0-5a71a4fc7774" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Interxion PAR5" -> (known after apply)
          ~ location_id           = 527 -> (known after apply)
          ~ product_name          = "EU (Paris) (eu-west-3)" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Wednesday, 28-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:38 EEST" -> (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:14 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (19 unchanged attributes hidden)
    }

  # megaport_vxc.internet will be updated in-place
  ~ resource "megaport_vxc" "internet" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "52cb6573-5cc8-45cc-8af1-d21db1fe3485" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "Megaport Internet" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Monday, 28-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:37 EEST" -> (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:12 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (18 unchanged attributes hidden)
    }

  # megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "daff9778-76d6-4df3-bae3-25bc2cf508ae" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-Port" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Wednesday, 28-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:36 EEST" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:11 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (17 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.Terraform will perform the following actions:

  # megaport_mve.fortigate will be updated in-place
  ~ resource "megaport_mve" "fortigate" {
      ~ contract_start_date    = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ last_updated           = "Monday, 29-Jul-24 16:34:33 EEST" -> (known after apply)
      ~ live_date              = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      + terminate_date         = (known after apply)
        # (26 unchanged attributes hidden)
    }

  # megaport_port.ipxgrx will be updated in-place
  ~ resource "megaport_port" "ipxgrx" {
      ~ contract_end_date      = "Monday, 28-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date    = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date            = "Monday, 29-Jul-24 16:34:00 EEST" -> (known after apply)
      ~ last_updated           = "Monday, 29-Jul-24 16:34:33 EEST" -> (known after apply)
      ~ live_date              = "Monday, 29-Jul-24 16:34:40 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          ~ interface = {
              ~ demarcation = <<-EOT
                    Equinix PA2/3
                    114 Rue Ambroise Croizat, Saint Denis
                    0210
                    Type: Single-mode Fibre Pair
                    Ports: PP:0210:1177142, ports 11+12
                    Termination: SC connector
                EOT -> (known after apply)
              ~ up          = 1 -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + terminate_date         = (known after apply)
        # (17 unchanged attributes hidden)
    }

  # megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "09e400a0-1b72-49ec-8ff0-5a71a4fc7774" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Interxion PAR5" -> (known after apply)
          ~ location_id           = 527 -> (known after apply)
          ~ product_name          = "EU (Paris) (eu-west-3)" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Wednesday, 28-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:38 EEST" -> (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:14 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (19 unchanged attributes hidden)
    }

  # megaport_vxc.internet will be updated in-place
  ~ resource "megaport_vxc" "internet" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "52cb6573-5cc8-45cc-8af1-d21db1fe3485" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "Megaport Internet" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Monday, 28-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:37 EEST" -> (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:12 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (18 unchanged attributes hidden)
    }

  # megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "85613ea7-3b27-458e-88da-a80e6e04faab" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ b_end                = {
          ~ current_product_uid   = "daff9778-76d6-4df3-bae3-25bc2cf508ae" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-Port" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Wednesday, 28-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-124" -> "A-123-2024-GER-123-125"
      ~ create_date          = "Monday, 29-Jul-24 16:34:36 EEST" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ last_updated         = "Monday, 29-Jul-24 16:35:11 EEST" -> (known after apply)
      ~ live_date            = "Monday, 29-Jul-24 16:35:20 EEST" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (17 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```